Repository: xima-media/xm_formcycle
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# wizard.description
source: Include a XIMA® FormCycle form
de: Bindet ein XIMA® FormCycle Formular ein

# tabs.form
source: Form
de: Formular

# tx_xmformcycle_form_id.label
source: Form
de: Formular

# error.configuration.title
source: Configuration error
de: Konfiguration Error

# error.connection.title
source: Connection error
de: Verbindungsfehler

# error.1709041996.message
source: The extension configuration "formcycleUrl" is missing or invalid
de: Die Extension Konfiguration "formcycleUrl" fehlt oder ist ungültig

# error.1709538688.message
source: The extension configuration "formcycleClientId" is missing
de: Die Extension Konfiguration "formcycleClientId" fehlt

# error.1709052040.message
source: The extension configuration "defaultIntegrationMode" is invalid. Valid options are: "integrated", "iFrame" or "AJAX".
de: Die Extension Konfiguration "defaultIntegrationMode" ist ungültig. Gültige Optionen sind: "integrated", "iFrame" oder "AJAX".

# defaultGroupNames.0
source: Ungrouped
de: Nicht gruppiert

# button.reload
source: Reload
de: Neu laden

# button.settings
source: Settings
de: Einstellungen

# flexform.sheet.responses
source: Response pages
de: Antwortseiten

# flexform.responses.success
source: Success page
de: Erfolgseite

# flexform.responses.success.description
source: Page to display after successful form submission
de: Seite, die nach erfolgreicher Formularübermittlung angezeigt wird

# flexform.responses.error
source: Error page
de: Fehlerseite

# flexform.responses.error.description
source: Response page when an error occurs during execution
de: Antwortseite, wenn während der Ausführung ein Fehler auftritt

# flexform.sheet.include
source: Integration options
de: Einbindungsoptionen

# flexform.integration
source: Integration type
de: Integrationsart

# flexform.integration.description
source: This defines how the Formcycle form is embedded into the page
de: Dies definiert, wie das Formcycle-Formular in die Seite eingebettet wird

# flexform.integration.default
source: Default
de: Standard

# flexform.integration.integrated
source: Integrated
de: Integriert

# flexform.integration.ajaxTypo3
source: AJAX (via TYPO3)
de: AJAX (über TYPO3)

# flexform.integration.ajaxFormcycle
source: AJAX (via Fromcycle)
de: AJAX (über Formcycle)

# flexform.jquery.checkbox
source: Include jQuery
de: jQuery einbinden

# flexform.jquery.description
source: If you uncheck this (use your own framework), make sure your jQuery framework is initialised
de: Wenn Sie dies abwählen (eigenes Framework verwenden), stellen Sie sicher, dass Ihr jQuery-Framework initialisiert ist

# flexform.jqueryUi.checkbox
source: Include jQuery UI
de: jQuery UI einbinden

# flexform.jqueryUi.description
source: This is only necessary if you use jQuery UI components
de: Dies ist nur erforderlich, wenn Sie jQuery UI-Komponenten verwenden

# flexform.bootstrap.checkbox
source: Include Response JS
de: Response JS einbinden

# flexform.bootstrap.description
source: This is only necessary if you use responsive design
de: Dies ist nur erforderlich, wenn Sie responsives Design verwenden

# flexform.parameters
source: Additional parameters
de: Zusätzliche Parameter

# flexform.parameters.description
source: Modify the Formcycle request, e.g. &param1=value1&param2=value2
de: Ändern Sie die Formcycle-Anfrage, z.B. &param1=value1&param2=value2

# tx_xmformcycle_redirect_success
source: Redirect on Success
de: Weiterleitung bei Erfolg

# tx_xmformcycle_redirect_error
source: Redirect on Error
de: Weiterleitung bei Fehler

# tx_xmformcycle_integration_mode
source: Integration Mode
de: Integrationsmodus

# tx_xmformcycle_integration_mode.0
source: Default
de: Standard

# tx_xmformcycle_integration_mode.1
source: Integrated
de: Integriert

# tx_xmformcycle_is_jquery
source: Include jQuery
de: jQuery einbinden

# tx_xmformcycle_is_jquery_ui
source: Include jQuery UI
de: jQuery UI einbinden

# tx_xmformcycle_additional_params
source: Additional Parameters
de: Zusätzliche Parameter
